In [3]:
import numpy as np, pandas as pd
import sqlite3 as sql
from dotenv import load_dotenv

In [4]:
load_dotenv()

True

In [5]:
db_path = 'C:\\Users\\User\\Desktop\\dev\\personal\\letterboxd-app\\db\\lb-film.db'

In [12]:
def db_info(db_path):
    '''
    prints out all of the columns of every table in db
    '''
    db_conn = sql.connect(db_path)
    tables = db_conn.cursor().execute("SELECT name FROM sqlite_master WHERE type='table';").fetchall()
    for table_name in tables:
        table_name = table_name[0] # tables is a list of single item tuples
        table = pd.read_sql_query("SELECT * from {} LIMIT 0".format(table_name), db_conn)
        print(table_name)
        for col in table.columns:
            print('\t' + col)
    db_conn.close()

In [15]:
def get_list_of_tables(db_path):
    db_conn = sql.connect(db_path)
    tables = db_conn.cursor().execute("SELECT name FROM sqlite_master WHERE type='table';").fetchall()
    db_conn.close()
    tables = [table[0] for table in tables]
    return tables

In [19]:
db_conn = sql.connect(db_path)
for t in get_list_of_tables(db_path):
    print(t, ':')
    display(pd.read_sql_query("SELECT * from {} LIMIT 10".format(t), db_conn))

FILM_YEAR :

   FILM_ID  FILM_YEAR FILM_DECADE
0  f_01ZLI       1995       1990s

PERSONAL_RATING :

Empty DataFrame
Columns: [FILM_ID, FILM_RATING_BASIC, FILM_RATING_SCALED, FILM_RATING_PERCENT]
Index: []

FILM_LETTERBOXD_STATS :

,FILM_ID,FILM_WATCH_COUNT,FILM_FAN_COUNT,FILM_LIKES_COUNT,FILM_REVIEW_COUNT,FILM_LIST_COUNT,FILM_TOP_250,FILM_RATING,FILM_RATING_COUNT
0,f_01ZLI,642074,536,114993,9893,35679,None,3.56,274561

FILM_AVAILABILITY :

Empty DataFrame
Columns: [FILM_ID, FILM_AVAILABLE, STREAMING_SERVICE]
Index: []

FILM_GENRE :

Empty DataFrame
Columns: [FILM_ID, FILM_GENRE]
Index: []

DIARY :

Empty DataFrame
Columns: [FILM_ID, DIARY_DATE, FILM_RATING, TAGS, FIRST_TIME_WATCH]
Index: []

INGESTED :

Empty DataFrame
Columns: [FILM_ID, INGESTION_DATE]
Index: []

WATCHED :

   FILM_ID
0  f_01ZLI
1  f_01UTC
2  f_020E4
3  f_01TBi
4  f_03z48
5  f_0t4EQ
6  f_0099A
7  f_023zw
8  f_0lac8
9  f_020Z2

WATCHLIST :

   FILM_ID  ADDED_DATE
0  f_02aGO  2021-01-13
1  f_029q6  2021-01-13
2  f_01WVK  2021-01-13
3  f_01WhU  2021-01-13
4  f_01Yzm  2021-01-13
5  f_0207Y  2021-01-13
6  f_01icK  2021-01-13
7  f_01MUW  2021-01-13
8  f_01Ori  2021-01-13
9  f_01Kce  2021-01-15

FILM_TITLE :

,FILM_ID,FILM_TITLE,FILM_URL_TITLE,LETTERBOXD_URL
0,f_01ZLI,Jumanji,,https://boxd.it/1ZLI
1,f_01UTC,Fatal Attraction,,https://boxd.it/1UTC
2,f_020E4,Punch-Drunk Love,,https://boxd.it/20E4
3,f_01TBi,Altered States,,https://boxd.it/1TBi
4,f_03z48,The Fear of God: 25 Years of The Exorcist,,https://boxd.it/3z48
5,f_0t4EQ,Death to 2020,,https://boxd.it/t4EQ
6,f_0099A,The Skin I Live In,,https://boxd.it/99A
7,f_023zw,"Synecdoche, New York",,https://boxd.it/23zw
8,f_0lac8,Bait,,https://boxd.it/lac8
9,f_020Z2,There Will Be Blood,,https://boxd.it/20Z2

In [20]:
db_conn.close()